package util

import scala.util.Random

object Zalgo {
  private val zalgoChars = List(
    0x30d, /*     Ì     */		 0x30e, /*     ÌŽ     */	 0x304, /*     Ì„     */	 0x305, /*     Ì…     */
    0x33f, /*     Ì¿     */		0x311, /*     Ì‘     */		0x306, /*     Ì†     */		0x310, /*     Ì     */
    0x352, /*     Í’     */		0x357, /*     Í—     */		0x351, /*     Í‘     */		0x307, /*     Ì‡     */
    0x308, /*     Ìˆ     */		0x30a, /*     ÌŠ     */		0x342, /*     Í‚     */		0x343, /*     Ì“     */
    0x344, /*     ÌˆÌ     */	 0x34a, /*     ÍŠ     */	 0x34b, /*     Í‹     */	 0x34c, /*     ÍŒ     */
    0x303, /*     Ìƒ     */		0x302, /*     Ì‚     */		0x30c, /*     ÌŒ     */		0x350, /*     Í     */
    0x300, /*     Ì€     */		0x301, /*     Ì     */		 0x30b, /*     Ì‹     */	 0x30f, /*     Ì     */
    0x312, /*     Ì’     */		0x313, /*     Ì“     */		0x314, /*     Ì”     */		0x33d, /*     Ì½     */
    0x309, /*     Ì‰     */		0x363, /*     Í£     */		0x364, /*     Í¤     */		0x365, /*     Í¥     */
    0x366, /*     Í¦     */		0x367, /*     Í§     */		0x368, /*     Í¨     */		0x369, /*     Í©     */
    0x36a, /*     Íª     */		0x36b, /*     Í«     */		0x36c, /*     Í¬     */		0x36d, /*     Í­     */
    0x36e, /*     Í®     */		0x36f, /*     Í¯     */		0x33e, /*     Ì¾     */		0x35b, /*     Í›     */
    0x346, /*     Í†     */		0x31a, /*     Ìš     */
    0x316, /*     Ì–     */		0x317, /*     Ì—     */		0x318, /*     Ì˜     */		0x319, /*     Ì™     */
    0x31c, /*     Ìœ     */		0x31d, /*     Ì     */		 0x31e, /*     Ìž     */	 0x31f, /*     ÌŸ     */
    0x320, /*     Ì      */		0x324, /*     Ì¤     */		0x325, /*     Ì¥     */		0x326, /*     Ì¦     */
    0x329, /*     Ì©     */		0x32a, /*     Ìª     */		0x32b, /*     Ì«     */		0x32c, /*     Ì¬     */
    0x32d, /*     Ì­     */		 0x32e, /*     Ì®     */	 0x32f, /*     Ì¯     */	 0x330, /*     Ì°     */
    0x331, /*     Ì±     */		0x332, /*     Ì²     */		0x333, /*     Ì³     */		0x339, /*     Ì¹     */
    0x33a, /*     Ìº     */		0x33b, /*     Ì»     */		0x33c, /*     Ì¼     */		0x345, /*     Í…     */
    0x347, /*     Í‡     */		0x348, /*     Íˆ     */		0x349, /*     Í‰     */		0x34d, /*     Í     */
    0x34e, /*     ÍŽ     */		0x353, /*     Í“     */		0x354, /*     Í”     */		0x355, /*     Í•     */
    0x356, /*     Í–     */		0x359, /*     Í™     */		0x35a, /*     Íš     */		0x323, /*     Ì£     */
    0x315, /*     Ì•     */		0x31b, /*     Ì›     */		0x340, /*     Ì€     */		0x341, /*     Ì     */
    0x358, /*     Í˜     */		0x321, /*     Ì¡     */		0x322, /*     Ì¢     */		0x327, /*     Ì§     */
    0x328, /*     Ì¨     */		0x334, /*     Ì´     */		0x335, /*     Ìµ     */		0x336, /*     Ì¶     */
    0x34f, /*     Í     */		 0x35c, /*     Íœ     */	 0x35d, /*     Í     */		0x35e, /*     Íž     */
    0x35f, /*     ÍŸ     */		0x360, /*     Í      */		0x362, /*     Í¢     */		0x338, /*     Ì¸     */
    0x337, /*     Ì·     */		0x361, /*     Í¡     */		0x489 /*     Ò‰_     */
  )

  def makeZalgo(text: String): String = {
    val builder = new StringBuilder()
    for (c <- text) {
      builder.append(c)
      for (_ <- 0 to 5) {
        builder.append(Random.shuffle(zalgoChars).head.toChar)
      }
    }
    builder.toString()
  }
}
